Lab | Data Structuring and Combining Data

Challenge 1: Combining & Cleaning Data
In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv
But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv
Note that you'll need to clean and format the new data.

Observation:

One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Importing the cleaned dataframe #1 from the last exercise

In [6]:
import pandas as pd

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"

In [7]:
df = pd.read_csv(url)
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [8]:
df1 = df.copy()
df1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [9]:
df1.columns = df1.columns.str.lower().str.replace(" ", "_") #changing to lower case and removing blanks
df1.rename(columns = {"st":"state"},inplace = True)  #renaming columns
df1.head()  #checking to see changes

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [12]:
#cleaning gender values
df1 ["gender"] = df1["gender"].replace(["F", "M", "Femal", "female"],["Female", "Male", "Female","Female"])
df1["gender"].unique()  #testing gender changes

array([nan, 'Female', 'Male'], dtype=object)

In [13]:
#cleaning state column values

df1 ["state"] = df1["state"].replace(["AZ", "Cali", "WA"],["Arizona", "California", "Washington"])
df1 ["state"].unique() #testing changes

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [14]:
#cleaning education column values

df1 ["education"] = df1["education"].replace("Bachelors", "Bachelor")
df1["education"].unique()  #testing changes

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [15]:
#In Customer Lifetime Value, delete the % character

df1['customer_lifetime_value'] = df1['customer_lifetime_value'].str.replace('%','')
df1 ["customer_lifetime_value"].unique()

array([nan, '697953.59', '1288743.17', ..., '2031499.76', '323912.47',
       '899704.02'], dtype=object)

In [16]:
#In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"

df1["vehicle_class"] = df1["vehicle_class"].replace(["Sports Car", "Luxury SUV", "Luxury Car"], "Luxury")
df1 ["vehicle_class"].unique()     #cheque for unique values changes

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

## Exercise 3: Formatting data types

In [21]:
#customer lifetime value to numeric
df1["customer_lifetime_value"] = pd.to_numeric(df1["customer_lifetime_value"])
df1["customer_lifetime_value"].dtype

dtype('float64')

In [22]:
#open complaints format change 
df1 ["number_of_open_complaints"].unique()  #checking unique values

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [23]:
#extracting values 
df1['number_of_open_complaints'] = df1['number_of_open_complaints'].str.split('/').str[1]
df1 ["number_of_open_complaints"].dtype

dtype('O')

In [24]:
df1["number_of_open_complaints"]= pd.to_numeric(df1["number_of_open_complaints"], errors='coerce')
df1 ["number_of_open_complaints"].dtype

dtype('float64')

In [ ]:
#Dealing with Null values

In [27]:
df1.isnull().sum()  #checking for nans

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [28]:
#dropping nans
df1.dropna(how = "all", inplace = True) #rows

In [29]:
#rechecking nans

df1.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [30]:
mode_value = df1['gender'].mode()[0] #checking mode for gender column as it is a categorical column
mode_value

'Female'

In [31]:
df1['gender'].fillna(mode_value, inplace=True)

/var/folders/35/95bptg013g75yzs_np0t8xw00000gn/T/ipykernel_79310/2993391742.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['gender'].fillna(mode_value, inplace=True)

In [32]:
#finding mean value for customer lifetime 
mean_value = round(df1['customer_lifetime_value'].mean(),2)
mean_value  #CALCULATING AVERAGE VALUE OF THE COLUMN

793690.26

In [33]:
#filling nan with mean
df1.fillna({"customer_lifetime_value":793690.26}, inplace=True)

In [34]:
#all numeric values to integers 
df1 = df1.apply(lambda x: x.astype(int) if x.dtype == 'float64' else x)
df1.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int64
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
policy_type                  object
vehicle_class                object
total_claim_amount            int64
dtype: object

In [ ]:
#Dealing with duplicates

In [37]:
df1.duplicated().sum()

0

In [38]:
df1.drop_duplicates(inplace=True)
df1.duplicated().sum()

0

# CHALLENGE 1

In [40]:
#New Data frames 

url_2 = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
df_2 = pd.read_csv(url_2)

url_3= "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"
df_3 = pd.read_csv(url_3)

In [41]:
#cleaning Dataframe 2 
df_2.columns = df_2.columns.str.lower().str.replace(" ", "_") #standardizing columns
df_2.rename(columns = {"st":"state"},inplace = True) #renaming states
df_2 ["gender"] = df_2["gender"].replace(["F", "M", "Femal", "female"],["Female", "Male", "Female","Female"]) # standardizinggender
df_2["state"] = df_2["state"].replace(["AZ", "Cali", "WA"],["Arizona", "California", "Washington"]) #standardizing state names
df_2["education"] = df_2["education"].replace("Bachelors", "Bachelor")
df_2['customer_lifetime_value'] = df_2['customer_lifetime_value'].str.replace('%','')
df_2["vehicle_class"] = df_2["vehicle_class"].replace(["Sports Car", "Luxury SUV", "Luxury Car"], "Luxury")

In [42]:
#cleaning Dataframe 3

df_3.columns = df_3.columns.str.lower().str.replace(" ", "_") #standardizing columns
df_3.rename(columns = {"st":"state"},inplace = True) #renaming state
df_3["gender"] = df_3["gender"].replace(["F", "M", "Femal", "female"],["Female", "Male", "Female","Female"]) #standardizing gender
df_3["state"] = df_3["state"].replace(["AZ", "Cali", "WA"],["Arizona", "California", "Washington"]) #standardizing state names
df_3["education"] = df_3["education"].replace("Bachelors", "Bachelor")
df_3["vehicle_class"] = df_3["vehicle_class"].replace(["Sports Car", "Luxury SUV", "Luxury Car"], "Luxury")

# formatting dataframes 2 and 3

In [45]:

df_2['customer_lifetime_value'] = df_2['customer_lifetime_value'].str.replace('%','')

In [46]:
#customer lifetime value to numeric
df_2["customer_lifetime_value"] = pd.to_numeric(df_2["customer_lifetime_value"])

In [47]:
#formatting number of open complaints dataframe 2 by splitting strings
df_2["number_of_open_complaints"].unique()  #checking unique values
df_2['number_of_open_complaints'] = df_2['number_of_open_complaints'].str.split('/').str[1]
df_2["number_of_open_complaints"].unique()

array(['0', '1', '3', '5', '2', '4'], dtype=object)

In [48]:
#formatting number of open complaints of data frame 2 to numeric
df_2["number_of_open_complaints"]= pd.to_numeric(df_2["number_of_open_complaints"], errors='coerce')
df_2["number_of_open_complaints"].dtype

dtype('int64')

In [50]:
df_3["customer_lifetime_value"] =round(df_3["customer_lifetime_value"],1)
df_3["total_claim_amount"] =round(df_3["total_claim_amount"],1)
df_3.dtypes

customer                      object
state                         object
customer_lifetime_value      float64
education                     object
gender                        object
income                         int64
monthly_premium_auto           int64
number_of_open_complaints      int64
policy_type                   object
total_claim_amount           float64
vehicle_class                 object
dtype: object

In [51]:
#Customer lifetime value and number of open complaints should be numeric

df_3["number_of_open_complaints"]= pd.to_numeric(df_3["number_of_open_complaints"], errors="coerce")
df_3["customer_lifetime_value"] = pd.to_numeric(df_3["customer_lifetime_value"], errors = "coerce")

# dropping and filling nans in dataframe #2 and dataframe #3

In [94]:
#dataframe 2 has nans
df_2.isnull().sum()  #checking for nans

customer                     0
state                        0
gender                       5
education                    0
customer_lifetime_value      4
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

In [106]:
mode_value = df_2['gender'].mode()[0]
mode_value

'Female'

In [108]:
df_2['gender'].fillna(mode_value, inplace=True)

In [110]:
mean_value = round(df_2['customer_lifetime_value'].mean(),2)
mean_value  #CALCULATING AVERAGE VALUE OF THE COLUMN

765149.39

In [114]:
df_2.fillna({"customer_lifetime_value":765149.39}, inplace=True)
df_2.isna().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
total_claim_amount           0
policy_type                  0
vehicle_class                0
dtype: int64

In [120]:
df_2 = df_2.apply(lambda x: x.astype(int) if x.dtype == 'float64' else x)
df_2.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int64
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
total_claim_amount            int64
policy_type                  object
vehicle_class                object
dtype: object

In [96]:
df_3.isnull().sum()  #checking for nans

customer                     0
state                        0
customer_lifetime_value      0
education                    0
gender                       0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
total_claim_amount           0
vehicle_class                0
dtype: int64

In [124]:
df_3 = df_3.apply(lambda x: x.astype(int) if x.dtype == 'float64' else x)
df_3.dtypes

customer                     object
state                        object
customer_lifetime_value       int64
education                    object
gender                       object
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
policy_type                  object
total_claim_amount            int64
vehicle_class                object
dtype: object

# dealing with duplicates

In [126]:
df_2.duplicated().sum()

0

In [128]:
df_3.duplicated().sum()

0

In [136]:
# CHALLENGE 1 CONCATENATING ALL THREE DATA FRAMES
df_4 = pd.concat([df1, df_2, df_3], axis = 0)
df_4.shape

(9137, 11)

# CHALLENGE 2

In [346]:
#data cleaning, formatting, and structuring.
url_4 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv'
df_5 =pd.read_csv(url_4)

In [347]:
df_5.shape

(10910, 27)

In [348]:
df_5.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [349]:
df_5.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

In [350]:
df_5.columns = df_5.columns.str.lower().str.replace(" ", "_") #standardizing columns
df_5.rename(columns = {"st":"state"},inplace = True) #renaming states
df_5.rename(columns = {"unnamed:_0":"number"},inplace = True) #renaming first column
df_5.rename(columns = {"employmentstatus":"employment_status"},inplace = True) #renaming states

In [351]:
df_5['customer_lifetime_value'] = round(df_5['customer_lifetime_value'],2)
df_5['total_claim_amount'] = round(df_5['total_claim_amount'],2)
df_5['number_of_open_complaints'] = round(df_5['number_of_open_complaints'],2)
df_5['months_since_last_claim'] = round(df_5['months_since_last_claim'],2)

In [352]:
df_5["vehicle_class"] = df_5["vehicle_class"].replace(["Sports Car", "Luxury SUV", "Luxury Car"], "Luxury")

In [353]:
df_5.dtypes

number                             int64
customer                          object
state                             object
customer_lifetime_value          float64
response                          object
coverage                          object
education                         object
effective_to_date                 object
employment_status                 object
gender                            object
income                             int64
location_code                     object
marital_status                    object
monthly_premium_auto               int64
months_since_last_claim          float64
months_since_policy_inception      int64
number_of_open_complaints        float64
number_of_policies                 int64
policy_type                       object
policy                            object
renew_offer_type                  object
sales_channel                     object
total_claim_amount               float64
vehicle_class                     object
vehicle_size                      object
vehicle_type                      object
month                              int64
dtype: object

In [354]:
#converting to numeric
df_5["customer_lifetime_value"] = pd.to_numeric(df_5["customer_lifetime_value"])

In [355]:
#converting to numeric
df_5["months_since_last_claim"] = pd.to_numeric(df_5["months_since_last_claim"])

In [356]:
#converting to numeric
df_5["number_of_open_complaints"] = pd.to_numeric(df_5["number_of_open_complaints"])

In [357]:
#dropping nans
df_5.isna().sum()

number                           0
customer                         0
state                            0
customer_lifetime_value          0
response                         0
coverage                         0
education                        0
effective_to_date                0
employment_status                0
gender                           0
income                           0
location_code                    0
marital_status                   0
monthly_premium_auto             0
months_since_last_claim          0
months_since_policy_inception    0
number_of_open_complaints        0
number_of_policies               0
policy_type                      0
policy                           0
renew_offer_type                 0
sales_channel                    0
total_claim_amount               0
vehicle_class                    0
vehicle_size                     0
vehicle_type                     0
month                            0
dtype: int64

In [358]:
df_5 = df_5.apply(lambda x: x.astype(int) if x.dtype == 'float64' else x)

In [359]:
df_5.duplicated().sum()

0

# You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail). Round the total revenue to 2 decimal points. Analyze the resulting table to draw insights.

In [362]:
pivot_df = df_5.pivot_table(index='number', columns='sales_channel', values= 'income')

In [364]:
pivot_df

sales_channel    Agent   Branch  Call Center      Web
number
0              48029.0      NaN          NaN      NaN
1                  NaN      NaN          0.0      NaN
2                  NaN      NaN      22139.0      NaN
3                  NaN  49078.0          NaN      NaN
4                  NaN  23675.0          NaN      NaN
...                ...      ...          ...      ...
10905              NaN      NaN          NaN      0.0
10906              NaN  61146.0          NaN      NaN
10907              NaN      NaN          NaN  39837.0
10908              NaN  64195.0          NaN      NaN
10909              NaN      NaN          NaN      0.0

[10910 rows x 4 columns]

In [370]:
pivot_df.isna().sum()

sales_channel
Agent          6789
Branch         7888
Call Center    8769
Web            9284
dtype: int64

In [375]:
pivot_df.describe() #analyzing the new table

sales_channel         Agent        Branch   Call Center           Web
count           4121.000000   3022.000000   2141.000000   1626.000000
mean           37003.191458  37649.109199  37858.479215  38253.445879
std            30290.475139  30190.432334  30347.098745  30862.888618
min                0.000000      0.000000      0.000000      0.000000
25%                0.000000  10242.500000      0.000000      0.000000
50%            33701.000000  33304.500000  34923.000000  34029.000000
75%            60880.000000  62339.250000  62873.000000  64801.000000
max            99961.000000  99845.000000  99875.000000  99981.000000

In [383]:
new_df= round(pivot_df.describe(),2)  #rounding it off to two decimal points

# Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [389]:

pivot_df2 = df_5.pivot_table(index='gender', columns='education', values= 'customer_lifetime_value')
pivot_df2

education,Bachelor,College,Doctor,High School or Below,Master
gender,,,,,
F,7873.794706,7748.316542,7328.000000,8674.722013,8156.536842
M,7703.095420,8051.946742,7414.865672,8149.192802,8168.344660

In [391]:
pivot_df2.describe() #analyzing the resulting table to draw insights

education,Bachelor,College,Doctor,High School or Below,Master
count,2.000000,2.000000,2.000000,2.000000,2.000000
mean,7788.445063,7900.131642,7371.432836,8411.957407,8162.440751
std,120.702623,214.698973,61.423305,371.605268,8.349388
min,7703.095420,7748.316542,7328.000000,8149.192802,8156.536842
25%,7745.770241,7824.224092,7349.716418,8280.575105,8159.488797
50%,7788.445063,7900.131642,7371.432836,8411.957407,8162.440751
75%,7831.119884,7976.039192,7393.149254,8543.339710,8165.392706
max,7873.794706,8051.946742,7414.865672,8674.722013,8168.344660

# BONUS 
You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month. Show it in a long format table.

In [411]:
#make a new data set with the three columns

new_df = df_5[["number_of_open_complaints","month", "policy_type"]].copy()
new_df

number_of_open_complaints    0
month                        0
policy_type                  0
dtype: int64

In [413]:
grouped = new_df.groupby(['policy_type', 'month'])
print (grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x12bee9d00>

In [417]:
no_of_complaints = grouped['number_of_open_complaints'].sum()
print (no_of_complaints)

policy_type     month
Corporate Auto  1         415
                2         361
Personal Auto   1        1635
                2        1363
Special Auto    1          84
                2          91
Name: number_of_open_complaints, dtype: int64